Repository: VincentAung9/sg_easy_hire
Catalog: lib/l10n/arb/app_*.arb
Languages: my

# appSubtitle
source: Find jobs in Singapore easily
my: စင်ကာပူရှိ အလုပ်များကို ရှာဖွေလိုက်ပါ

source: Welcome Back
my: ပြန်လည်ကြိုဆိုပါတယ်

# signInSubtitle
source: Sign in to continue to your account
my: သင့်အကောင့်သို့ ဝင်ရောက်ရန် စာရင်းဝင်ပါ

source: Notifications
my: အကြောင်းကြားချက်များ

source: Phone Number
my: ဖုန်းနံပါတ်

source: Password
my: စကားဝှက်

source: Enter password
my: စကားဝှက် ရိုက်ထည့်ပါ

# signInContinue
source: Continue
my: ဝင်ရောက်ရန်

# signUpContinue
source: Continue
my: စာရင်းသွင်းရန်

# noAccount
source: Don't have an account?
my: အကောင့်မရှိဘူးလား?

source: Sign Up
my: စာရင်းသွင်းမည်

# signUpSubtitle
source: Create your account to get started
my: အကောင့်အသစ် ဖန်တီးပြီး စတင်ပါ

# createAccountTitle
source: Create Account
my: အကောင့် ဖန်တီးခြင်း

# createAccountSubtitle
source: Sign up with your phone number
my: ဖုန်းနံပါတ်ဖြင့် စာရင်းသွင်းပါ

# fullNameLabel
source: Full Name
my: အမည်အပြည့်အစုံ

# fullNameHint
source: Enter your full name
my: အမည်အပြည့်အစုံ ရိုက်ထည့်ပါ

# phoneNumberLabel
source: Phone Number
my: ဖုန်းနံပါတ်

# passwordLabel
source: Password
my: စကားဝှက်

# passwordHint
source: Enter password
my: စကားဝှက်ရိုက်ထည့်ပါ

# alreadyHaveAccount
source: Already have an account?
my: အကောင့်ရှိပြီးသားလား?။

# phoneNumberRequire
source: Phone number is required
my: ဖုန်းနံပါတ် ထည့်ရန်လိုအပ်ပါသည်။

# passwordRequire
source: Password is required
my: စကားဝှက်ဖြည့်ပါ

# fullNameRequire
source: Full name is required
my: အမည်အပြည့်အစုံ ထည့်ရန်လိုအပ်ပါသည်။

source: Employer App
my: အလုပ်ရှင် အက်ပ်

source: Helper App
my: အလုပ်ရှာသူ အက်ပ်

# employerSubtitle
source: Find Helper for your needs
my: သင့်လိုအပ်ချက်အတွက် အကူအညီပေးသူကို ရှာဖွေပါ

# helperSubtitle
source: Find your dream job in Singapore
my: စင်္ကာပူတွင် သင့်အိမ်မက်အလုပ်ကို ရှာဖွေပါ

source: Enter Verification Code
my: အတည်ပြုကုဒ် ထည့်ပါ

# verifyCodeSubtitle
source: Verify your number with the 6-digit code we just sent via SMS.
my: SMS ဖြင့် ပို့ထားသော ဂဏန်း ၆ လုံးပါ ကုဒ်ကို ထည့်၍ သင့်ဖုန်းနံပါတ်ကို အတည်ပြုပါ။

# pinIncorrect
source: PIN is incorrect.
my: PIN ကုဒ် မမှန်ပါ။

# dontReceiveOtp
source: Don't receive the OTP?
my: OTP မရရှိသေးဘူးလား?

source: RESEND OTP
my: OTP ပြန်ပို့ပါ

# resendOtpFailed
source: We couldn't resend the code. Please try again.
my: ကုဒ်ကို ပြန်ပို့၍ မရပါ။ ထပ်မံကြိုးစားပါ။

# resendOtpSuccess
source: A new code has been sent to your phone.
my: ကုဒ်အသစ်ကို သင့်ဖုန်းသို့ ပို့ပြီးပါပြီ။

# verifyFailed
source: Verification failed. Please try again.
my: အတည်ပြုခြင်း မအောင်မြင်ပါ။ ထပ်မံကြိုးစားပါ။

# verifySuccess
source: Verification successful! Your account is now ready.
my: အတည်ပြုမှု အောင်မြင်ပါသည်။ သင့်အကောင့် အသုံးပြုနိုင်ပါပြီ။

source: Verify
my: အတည်ပြုပါ

# onboardingTitle
source: Help Us Know You Better
my: သင့်အကြောင်းကို ပိုမိုသိရှိရန် ကူညီပါ

# onboardingSubtitle
source: Complete your profile to increase your chances of finding the perfect job
my: သင့်ပရိုဖိုင်ကို ပြီးစီးစေရန် အလုပ်ရရှိနိုင်ချေ ပိုမိုမြင့်မားစေပါသည်

# estimatedTimeTitle
source: Estimated Time: 10–15 minutes
my: ခန့်မှန်းချိန် – ၁၀ မှ ၁၅ မိနစ်

# estimatedTimeDesc
source: This questionnaire helps employers understand your skills, experience, and preferences to match you with suitable job opportunities.
my: ဤမေးခွန်းများသည် အလုပ်ရှင်များအား သင့်ကျွမ်းကျင်မှု၊ အတွေ့အကြုံနှင့် လိုလားချက်များကို နားလည်စေရန် ကူညီပေးပါသည်

# whatWeAskTitle
source: What We'll Ask About:
my: မေးမြန်းမည့် အချက်များ:

# askPersonalInfo
source: Personal information (name, age, nationality)
my: ကိုယ်ရေးကိုယ်တာအချက်အလက်များ (အမည်၊ အသက်၊ နိုင်ငံသား)

# askContactFamily
source: Contact details and family background
my: ဆက်သွယ်ရန်အချက်အလက်နှင့် မိသားစုအခြေအနေ

# askMedicalFood
source: Medical history and food preferences
my: ကျန်းမာရေးမှတ်တမ်းနှင့် အစားအစာနှစ်သက်မှု

# askLanguageSkills
source: Languages spoken and skills
my: ပြောဆိုနိုင်သောဘာသာစကားများနှင့် ကျွမ်းကျင်မှုများ

# askWorkPreference
source: Work experience and job preferences
my: အလုပ်အတွေ့အကြုံနှင့် အလုပ်လိုလားချက်များ

# askDocuments
source: Document uploads (passport, certificates, photo)
my: စာရွက်စာတမ်းများ (ပတ်စပို့၊ လက်မှတ်များ၊ ဓာတ်ပုံ)

# importantInfoTitle
source: Important Information
my: အရေးကြီးသော အချက်အလက်များ

# infoSkip_part1
source: You can
my: သင်သည်

# infoSkip_bold
source: skip any questions
my: မဖြေလိုသေးသော မေးခွန်းများကို

# infoSkip_part2
source: you're not ready to answer
my: ကျော်လွှားနိုင်ပါသည်

# infoMandatory_bold
source: Mandatory fields (*)
my: မဖြစ်မနေဖြေဆိုရမည့် အချက်များ (*)

# infoMandatory_part2
source: are required for your biodata to be visible to employers
my: သည် အလုပ်ရှင်များမြင်နိုင်ရန် လိုအပ်ပါသည်

# infoApplyLater
source: If you skip now, you'll be asked to complete this when applying for jobs
my: ယခုကျော်လွှားပါက အလုပ်လျှောက်ရာတွင် နောက်တစ်ကြိမ် ဖြေဆိုရပါမည်

# infoViews_part1
source: Complete profiles get
my: ပရိုဖိုင်ပြည့်စုံပါက

# infoViews_bold
source: 3x more views
my: ၃ ဆ ပိုမိုမြင်တွေ့ရနိုင်

# infoViews_part2
source: from employers
my: ပါသည်

source: Skip for Now
my: ယခုအချိန် ကျော်လွှားမည်

# getStarted
source: Let's Get Started
my: စတင်လိုက်ကြစို့

source: Back
my: နောက်သို့

# languageSettingsTitle
source: Language Settings
my: ဘာသာစကား ပြင်ဆင်မှု

# skip
source: Skip For Now
my: ကျော်လွှားမည်

source: App language
my: အပ်ပ် ဘာသာစကား

# appLanguageDesc
source: Choose your preferred language for the app interface
my: အက်ပ်အတွက် သင်နှစ်သက်သော ဘာသာစကားကို ရွေးချယ်ပါ

source: Available Languages
my: ရရှိနိုင်သော ဘာသာစကားများ

# availableLanguagesDesc
source: Select a language to change the app interface
my: အက်ပ်၏ ဘာသာစကားကို ပြောင်းရန် ရွေးချယ်ပါ

source: Save Language Preference
my: ဘာသာစကား ပြောင်းလဲမှု သိမ်းဆည်းမည်

# languageRefreshHint
source: The app will refresh to apply the new language
my: ဘာသာစကားအသစ် အသုံးပြုရန် အက်ပ်ကို ပြန်လည်စတင်ပါမည်

source: English
my: အင်္ဂလိပ်

source: Myanmar
my: မြန်မာ

source: Settings
my: ဆက်တင်များ

# dashboardGreeting
source: Hello, {name}!
my: မင်္ဂလာပါ {name}!

# dashboardSubtitle
source: Ready to find your next opportunity?
my: သင့်အလုပ်အကိုင်အသစ်ကို ရှာဖွေရန် အဆင်သင့်ဖြစ်ပြီလား?

source: Profile Views
my: ပရိုဖိုင် ကြည့်ရှုမှုများ

source: Applied Jobs
my: လျှောက်ထားပြီးသော အလုပ်များ

source: Interviews
my: အင်တာဗျူးများ

# profileCompletionTitle
source: Profile: {percent}% Complete
my: ပရိုဖိုင် ပြည့်စုံမှု {percent}%

# profileCompletionSubtitle
source: Add documents to boost visibility
my: မြင်သာမှုတိုးစေရန် စာရွက်စာတမ်းများ ထည့်ပါ

# quickActionsTitle
source: Quick Actions
my: လျင်မြန်စွာ လုပ်ဆောင်ရန်

# quickActionUpdateBiodata
source: Update Biodata
my: ကိုယ်ရေးအချက်အလက် ပြင်ဆင်ရန်

# quickActionPersonalityTest
source: Personality Test
my: ကိုယ်ရည်ကိုယ်သွေး စစ်ဆေးမှု

# quickActionGuidelines
source: Guidelines
my: လမ်းညွှန်ချက်များ

# quickActionUploadDocuments
source: Upload Documents
my: စာရွက်စာတမ်း တင်ရန်

# quickActionSearchJobs
source: Search Jobs
my: အလုပ်ရှာရန်

# nextInterviewTitle
source: Next Interview
my: နောက်လာမည့် အင်တာဗျူး

# interviewDateLabel
source: Interview Date
my: အင်တာဗျူး ရက်စွဲ

# interviewTomorrow
source: Tomorrow
my: မနက်ဖြန်

# interviewSalaryLabel
source: Salary
my: လစာ

# interviewFamilyLabel
source: Family
my: မိသားစု

# interviewFamilyMembers
source: {count} members
my: အဖွဲ့ဝင် {count} ယောက်

# interviewDutiesLabel
source: Duties
my: တာဝန်များ

# interviewOffDaysLabel
source: Off Days
my: နားရက်များ

# interviewCancel
source: Cancel
my: ပယ်ဖျက်ရန်

# jobInFamily
source: {count} in family
my: မိသားစုဝင် {count} ယောက်

# jobChildren
source: {count} children
my: ကလေး {count} ယောက်

# jobOffDays
source: Off days: {days}
my: နားရက်များ - {days}

# jobApplied
source: Applied
my: လျှောက်ထားပြီး

# jobApplyNow
source: Apply Now
my: အလုပ်လျှောက်ရန်

source: All
my: အားလုံး

source: View Details
my: အသေးစိတ်ကြည့်ရန်

# adultCountLabel
source: {count} Adult
my: အရွယ်ရောက်သူ {count} ဦး

# elderlyCountLabel
source: {count} Elderly
my: အသက်ကြီးသူ {count} ဦး

# countdownDays
source: days
my: ရက်

# countdownHours
source: hrs
my: နာရီ

# countdownMinutes
source: mins
my: မိနစ်

# interviewStatusAccept
source: Accept
my: လက်ခံမည်

# interviewStatusCancel
source: Cancel
my: ပယ်ဖျက်မည်

# interviewStatusCompleted
source: Completed
my: ပြီးဆုံးပြီး

# interviewStatusCancelled
source: Cancelled
my: ပယ်ဖျက်ပြီး

# interviewStatusNoShow
source: No Show
my: မလာရောက်ပါ

# interviewStatusProcessing
source: Interviewing
my: အင်တာဗျူးလုပ်ဆောင်နေသည်

source: Time
my: အချိန်

source: Select Interview Time
my: အင်တာဗျူး အချိန်ရွေးချယ်ပါ

# selectInterviewTimeSubtitle
source: Choose your preferred time slot for the interview
my: အင်တာဗျူးအတွက် သင်နှစ်သက်သော အချိန်ကို ရွေးချယ်ပါ

# interviewScheduledSuccess
source: Interview scheduled for selected time!
my: ရွေးချယ်ထားသော အချိန်အတိုင်း အင်တာဗျူး အချိန်သတ်မှတ်ပြီးပါပြီ

source: Confirm Selection
my: အတည်ပြုမည်

source: Cancel
my: မလုပ်တော့ပါ

source: Date
my: ရက်စွဲ

# profilePendingTitle
source: Profile Pending
my: ပရိုဖိုင် စစ်ဆေးနေဆဲ

# profilePendingDesc
source: Admin is checking your biodata
my: အက်မင်က သင့်ကိုယ်ရေးအချက်အလက်များကို စစ်ဆေးနေပါသည်

# profileApprovedTitle
source: Profile Approved
my: ပရိုဖိုင် အတည်ပြုပြီးပါပြီ

# profileApprovedDesc
source: Your profile has been approved
my: သင့်ပရိုဖိုင်ကို အတည်ပြုပြီးပါပြီ

# profileRejectedTitle
source: Profile Rejected
my: ပရိုဖိုင် ပယ်ချခံရပါသည်

# profileRejectedDesc
source: Your profile was rejected. Please update your biodata
my: သင့်ပရိုဖိုင်ကို ပယ်ချခဲ့ပါသည်။ ကိုယ်ရေးအချက်အလက်များကို ပြန်လည် ပြင်ဆင်ပါ

# stepProgress
source: Step {current} of {total}
my: အဆင့် {current} / {total}

# personalInfoTitle
source: Personal Information
my: ကိုယ်ရေးအချက်အလက်

# personalInfoSubtitle
source: Let's start with your basic details
my: အခြေခံအချက်အလက်များကို စတင်ဖြည့်ပါ

# fullNamePlaceholder
source: Enter your full name
my: သင့်အမည်အပြည့်အစုံ ထည့်ပါ

# dateOfBirthLabel
source: Date of Birth
my: မွေးနေ့

# dateOfBirthPlaceholder
source: dd/mm/yyyy
my: နေ့/လ/နှစ်

# placeOfBirthLabel
source: Place of Birth
my: မွေးဖွားရာနေရာ

# placeOfBirthPlaceholder
source: City/Town
my: မြို့ / ရွာ

# nationalityLabel
source: Nationality
my: နိုင်ငံသားမှု

# nationalityPlaceholder
source: Select nationality
my: နိုင်ငံသားမှု ရွေးပါ

# genderLabel
source: Gender
my: လိင်

# genderPlaceholder
source: Select gender
my: လိင် ရွေးပါ

# genderMale
source: Male
my: အမျိုးသား

# genderFemale
source: Female
my: အမျိုးသမီး

# genderOther
source: Other
my: အခြား

# heightLabel
source: Height (cm)
my: အမြင့် (စင်တီမီတာ)

# heightPlaceholder
source: e.g., 161
my: ဥပမာ - 161

# weightLabel
source: Weight (kg)
my: အလေးချိန် (ကီလိုဂရမ်)

# weightPlaceholder
source: e.g., 41
my: ဥပမာ - 41

# submitSuccess
source: Submitted successfully
my: အောင်မြင်စွာ တင်ပြီးပါပြီ

# draftSaveSuccess
source: Draft saved successfully
my: မူကြမ်းအဖြစ် သိမ်းဆည်းပြီးပါပြီ

# submitFailed
source: Submission failed
my: တင်သွင်းမှု မအောင်မြင်ပါ

# calendarDialogTitle
source: Select date
my: နေ့စွဲ ရွေးချယ်ပါ

# fieldRequiredError
source: {field} is required
my: {field} ကို မဖြစ်မနေ ဖြည့်ရပါမည်

# contactFamilyTitle
source: Contact & Family Details
my: ဆက်သွယ်ရန်နှင့် မိသားစုအချက်အလက်များ

# contactFamilySubtitle
source: How can we reach you and your family information
my: သင့်ကို ဆက်သွယ်နိုင်ရန်နှင့် မိသားစုအချက်အလက်များကို ဖြည့်သွင်းပါ

# residentialAddressLabel
source: Residential Address in Home Country
my: မွေးရပ်နိုင်ငံရှိ နေရပ်လိပ်စာ

# residentialAddressPlaceholder
source: Enter your full address
my: နေရပ်လိပ်စာ အပြည့်အစုံ ဖြည့်ပါ

# contactNumberLabel
source: Contact Number in Home Country
my: မွေးရပ်နိုင်ငံရှိ ဆက်သွယ်ရန်ဖုန်းနံပါတ်

# contactNumberPlaceholder
source: e.g., +95 123456789
my: ဥပမာ - +95 123456789

# airportLabel
source: Port/Airport for Repatriation
my: ပြန်လည်ပို့ဆောင်ရန် ဆိပ်ကမ်း / လေဆိပ်

# airportPlaceholder
source: e.g., Yangon International Airport
my: ဥပမာ - Yangon International Airport

# emailLabel
source: Email Address (Optional)
my: အီးမေးလ်လိပ်စာ (မဖြစ်မနေ မလိုပါ)

# religionLabel
source: Religion
my: ဘာသာရေး

# religionPlaceholder
source: Select religion
my: ဘာသာရေးကို ရွေးချယ်ပါ

# educationLabel
source: Education Level
my: ပညာရေးအဆင့်

# educationPlaceholder
source: Select education level
my: ပညာရေးအဆင့်ကို ရွေးချယ်ပါ

# siblingsLabel
source: Number of Siblings
my: မောင်နှမ အရေအတွက်

# childrenLabel
source: Number of Children
my: ကလေး အရေအတွက်

# maritalStatusLabel
source: Marital Status
my: အိမ်ထောင်ရေးအခြေအနေ

# maritalStatusPlaceholder
source: Select marital status
my: အိမ်ထောင်ရေးအခြေအနေကို ရွေးချယ်ပါ

# childrenAgeLabel
source: Age(s) of Children (if any)
my: ကလေးများ၏ အသက် (ရှိပါက)

# childrenAgePlaceholder
source: e.g., 5, 8, 12
my: ဥပမာ - 5, 8, 12

source: Save Draft
my: အကြမ်းသိမ်းဆည်းမည်

source: Next
my: ရှေ့သို့

# medicalHistoryTitle
source: Medical History
my: ကျန်းမာရေးမှတ်တမ်း

# medicalHistorySubtitle
source: Please provide your medical information
my: သင့်ကျန်းမာရေးအချက်အလက်များကို ဖြည့်သွင်းပါ

# allergiesLabel
source: Do you have any allergies?
my: ဓာတ်မတည့်မှုများ ရှိပါသလား။

# allergiesPlaceholder
source: List any allergies (or write 'NIL' if none)
my: ဓာတ်မတည့်မှုများကို ရေးပါ (မရှိပါက 'NIL' ဟုရေးပါ)

# pastExistingIllnessesTitle
source: Past and Existing Illnesses
my: ယခင်နှင့် လက်ရှိ ရောဂါများ

# pastExistingIllnessesSubtitle
source: Select any conditions you have or had:
my: ရှိခဲ့ဖူးသော သို့မဟုတ် လက်ရှိရှိသော ရောဂါများကို ရွေးချယ်ပါ။

# illnessMental
source: Mental illness
my: စိတ်ပိုင်းဆိုင်ရာရောဂါ

# illnessTuberculosis
source: Tuberculosis
my: တီဘီရောဂါ

# illnessEpilepsy
source: Epilepsy
my: အတက်ရောဂါ

# illnessHeartDisease
source: Heart disease
my: နှလုံးရောဂါ

# illnessAsthma
source: Asthma
my: အသက်ရှူကြပ်ရောဂါ

# illnessMalaria
source: Malaria
my: မလေးရီးယားရောဂါ

# illnessDiabetes
source: Diabetes
my: ဆီးချိုရောဂါ

# illnessOperations
source: Had Operations
my: ခွဲစိတ်ကုသမှု ရှိခဲ့ဖူးသည်

# illnessHypertension
source: Hypertension
my: သွေးပေါင်မြင့်ရောဂါ

# otherIllnessesLabel
source: Other Illnesses (if any)
my: အခြားရောဂါများ (ရှိပါက)

# otherIllnessesPlaceholder
source: Please specify
my: အသေးစိတ်ဖော်ပြပါ

# physicalDisabilitiesLabel
source: Physical Disabilities
my: ကိုယ်ခန္ဓာမသန်စွမ်းမှုများ

# physicalDisabilitiesPlaceholder
source: List any physical disabilities (or write 'NIL' if none)
my: မသန်စွမ်းမှုများကို ရေးပါ (မရှိပါက 'NIL' ဟုရေးပါ)

# dietaryRestrictionsLabel
source: Dietary Restrictions
my: အစားအသောက်ကန့်သတ်ချက်များ

# dietaryRestrictionsPlaceholder
source: Any dietary restrictions? (or write 'NIL' if none)
my: အစားအသောက်ကန့်သတ်ချက်ရှိပါသလား (မရှိပါက 'NIL' ဟုရေးပါ)

# foodHandlingPreferencesTitle
source: Food Handling Preferences
my: အစားအစာကို ကိုင်တွယ်လုပ်ဆောင်နိုင်မှုများ

# accommodationPreferencesTitle
source: Accommodation Preferences
my: နေထိုင်မှုဆိုင်ရာ အကြိုက်များ

# selectAllThatApply
source: Select all that apply to you
my: သင့်အတွက် သင့်လျော်သော အရာအားလုံးကို ရွေးချယ်ပါ

# languagesSpokenTitle
source: Languages Spoken
my: ပြောနိုင်သော ဘာသာစကားများ

# selectLanguagesSpoken
source: Select all languages you can speak
my: သင် ပြောနိုင်သော ဘာသာစကားအားလုံးကို ရွေးချယ်ပါ

# experienceAndSkills
source: Experience & Skills
my: အတွေ့အကြုံနှင့် ကျွမ်းကျင်မှုများ

source: Total Experience
my: စုစုပေါင်း အတွေ့အကြုံ

# totalExperiencePlaceholder
source: e.g. 5 year
my: ဥပမာ ၅ နှစ်

source: Skills
my: ကျွမ်းကျင်မှုများ

# skillsPlaceholder
source: e.g. Cooking, Childcare, Cleaning
my: ဥပမာ အစားအသောက်ချက်ခြင်း၊ ကလေးစောင့်ရှောက်မှု၊ သန့်ရှင်းရေး

source: Job Preferences
my: အလုပ်အကိုင် ဆန္ဒများ

# jobPreferencesDesc
source: Tell us about your job expectations
my: သင့်အလုပ်အကိုင် ဆန္ဒများကို ပြောပြပါ

source: Expected Monthly Salary
my: မျှော်မှန်းထားသော လစဉ်လစာ

source: Select your experience
my: သင့်အတွေ့အကြုံကို ရွေးချယ်ပါ

# experienceRequired
source: Experience is required
my: အတွေ့အကြုံ လိုအပ်ပါသည်

source: Salary
my: လစာ

# preferredOffDays
source: Preferred Off Days per Month
my: လစဉ် အနားယူရက် အရေအတွက်

# selectPreferredOffDays
source: Select your preferred off days
my: အနားယူရက်ကို ရွေးချယ်ပါ

# preferredLocation
source: Preferred Location in Singapore
my: စင်ကာပူရှိ နှစ်သက်ရာနေရာ

# selectPreferredLocation
source: Select your preferred location
my: နှစ်သက်ရာနေရာကို ရွေးချယ်ပါ

# willingRestDay
source: Willing to work on rest days for compensation?
my: အနားယူရက်တွင် အလုပ်လုပ်ရန် ဆန္ဒရှိပါသလား?

# willingYes
source: Yes, willing
my: ဟုတ်ကဲ့၊ လုပ်နိုင်ပါသည်

# willingNo
source: Prefer not to
my: မလိုလားပါ

# salaryInputRequired
source: Please input your expected salary
my: သင့်မျှော်မှန်းလစာကို ထည့်သွင်းပါ

# selectExperienceAndSalary
source: Please select your experience and input expected salary.
my: အတွေ့အကြုံရွေးပြီး လစာထည့်ပါ

# salaryLimit500
source: Your expected salary shouldn't be greater than $500
my: သင့်လစာသည် $500 ထက် မကျော်လွန်ရပါ

# salaryLimit520
source: Your expected salary shouldn't be greater than $520
my: သင့်လစာသည် $520 ထက် မကျော်လွန်ရပါ

# salaryLimit580
source: Your expected salary shouldn't be greater than $580
my: သင့်လစာသည် $580 ထက် မကျော်လွန်ရပါ

# salaryLimit700
source: Your expected salary shouldn't be greater than $700
my: သင့်လစာသည် $700 ထက် မကျော်လွန်ရပါ

# salaryLimit670
source: Your expected salary shouldn't be greater than $670
my: သင့်လစာသည် $670 ထက် မကျော်လွန်ရပါ

# expNo
source: No experiences
my: အတွေ့အကြုံမရှိ

# expNoCert
source: No experiences but nursing aid certificates
my: အတွေ့အကြုံမရှိသော်လည်း Nursing Aid လက်မှတ်ရှိ

# expMiddleEast
source: Middle east experiences
my: အရှေ့အလယ်ပိုင်း အတွေ့အကြုံရှိ

# expSingapore
source: Singapore experiences
my: စင်ကာပူ အတွေ့အကြုံရှိ

# expTaiwan
source: Taiwan experiences
my: တိုင်ဝမ် အတွေ့အကြုံရှိ

# offDay1
source: 1 day
my: ၁ ရက်

# offDay2
source: 2 days
my: ၂ ရက်

# offDay3
source: 3 days
my: ၃ ရက်

# offDay4
source: 4 days
my: ၄ ရက်

# offDay5
source: 5 days
my: ၅ ရက်

# offDay6
source: 6 days
my: ၆ ရက်

# offDay7
source: 7 days
my: ၇ ရက်

# offDay8
source: 8 days
my: ၈ ရက်

# locationAny
source: Any location in Singapore
my: စင်ကာပူ အနှံ့

# locationNorth
source: North
my: မြောက်ပိုင်း

# locationSouth
source: South
my: တောင်ပိုင်း

# locationEast
source: East
my: အရှေ့ပိုင်း

# locationWest
source: West
my: အနောက်ပိုင်း

# locationCentral
source: Central
my: ဗဟိုပိုင်း

source: Work History
my: အလုပ်အတွေ့အကြုံ

source: Location
my: နေရာ

source: Select Country
my: နိုင်ငံကို ရွေးချယ်ပါ

source: Duration
my: ကြာချိန်

# durationPlaceholder
source: 2 years
my: ၂ နှစ်

source: Description
my: ဖော်ပြချက်

# descriptionPlaceholder
source: Family with 2 children
my: ကလေး ၂ ယောက်ပါဝင်သော မိသားစု

source: Duties
my: တာဝန်များ

# dutiesPlaceholder
source: Childcare, Cooking
my: ကလေးစောင့်ရှောက်မှု၊ အစားအသောက်ချက်ခြင်း

source: + Add Work History
my: + အလုပ်အတွေ့အကြုံ ထည့်ရန်

source: Remove
my: ဖယ်ရှားရန်

# uploadDocumentsTitle
source: Upload Your Documents
my: စာရွက်စာတမ်းများ တင်ရန်

# documentsSavedSuccess
source: Your documents have been saved
my: စာရွက်စာတမ်းများကို အောင်မြင်စွာ သိမ်းဆည်းပြီးပါပြီ

# documentsSaveFailed
source: Failed to save your documents. Please try again.
my: စာရွက်စာတမ်းများ သိမ်းဆည်းမှု မအောင်မြင်ပါ။ ထပ်မံကြိုးစားပါ။

# documentsEmptyError
source: Documents are empty.
my: စာရွက်စာတမ်း မရှိပါ။

# draftSavedSuccess
source: Draft saved successfully.
my: မူကြမ်းကို အောင်မြင်စွာ သိမ်းဆည်းပြီးပါပြီ

source: Introduction Video
my: မိတ်ဆက်ဗီဒီယို

source: Profile Photo
my: ကိုယ်ရေးဓာတ်ပုံ

# photoFormats
source: JPG, PNG (Max 5MB)
my: JPG, PNG (၅MB အများဆုံး)

source: Passport
my: နိုင်ငံကူးလက်မှတ်

# passportFormats
source: PDF, JPG, PNG (Max 5MB)
my: PDF, JPG, PNG (၅MB အများဆုံး)

source: Medical Certificate
my: ဆေးဘက်ဆိုင်ရာ ထောက်ခံစာ

source: Police Clearance
my: ရဲထောက်ခံစာ

# documentFormats
source: PDF, JPG, PNG (Max 5MB)
my: PDF, JPG, PNG (၅MB အများဆုံး)

# documentFormatsMultiple
source: PDF, JPG, PNG (Max 5MB each)
my: PDF, JPG, PNG (ဖိုင်တစ်ခုစီ ၅MB အများဆုံး)

source: Educational Certificates
my: ပညာရေး လက်မှတ်များ

source: Work References
my: အလုပ်ကိုးကားစာများ

source: Submit
my: တင်သွင်းရန်

# personalityTestTitle
source: Personality Test
my: ကိုယ်ရည်ကိုယ်သွေး စမ်းသပ်မှု

# personalityTestDescription
source: Answer a few statements to get a quick MBTI-style type (E/I, S/N, T/F, J/P). This is an unofficial educational tool.
my: မေးခွန်းအချို့ကို ဖြေဆိုခြင်းဖြင့် MBTI ပုံစံ (E/I, S/N, T/F, J/P) ကို အကျဉ်းချုပ် သိရှိနိုင်ပါသည်။ ဤစမ်းသပ်မှုသည် ပညာရေးရည်ရွယ်ချက်အတွက်သာ ဖြစ်ပါသည်။

# personalityTestInfo
source: There are 16 questions. Tap a dot to show how much you agree. Try to answer based on your typical behavior.
my: မေးခွန်း ၁၆ ခု ပါရှိပါသည်။ သင် သဘောတူသည့်အတိုင်း အမှတ်ကို နှိပ်ပါ။ ပုံမှန် အပြုအမူအပေါ် အခြေခံ၍ ဖြေဆိုပါ။

source: Start
my: စတင်ရန်

# questionsRangeTitle
source: Questions {start} - {end} / {total}
my: မေးခွန်း {start} - {end} / {total}

source: Please answer all questions.
my: မေးခွန်းအားလုံးကို ဖြေပါ။

source: Previous
my: နောက်သို့

source: Finish
my: ပြီးဆုံး

source: Language
my: ဘာသာစကား

source: Guidelines
my: လမ်းညွှန်ချက်များ

source: Important
my: အရေးကြီး

source: Platform Guidelines
my: ပလက်ဖောင်း လမ်းညွှန်ချက်များ

# platformGuidelinesDesc
source: Follow these guidelines to ensure a positive experience and increase your chances of finding the perfect job.
my: ကောင်းမွန်သော အတွေ့အကြုံရရှိစေရန်နှင့် သင့်အတွက် သင့်လျော်သော အလုပ်ရရှိနိုင်ရန် အောက်ပါ လမ်းညွှန်ချက်များကို လိုက်နာပါ။

source: Profile Completion
my: ပရိုဖိုင် ပြည့်စုံမှု

# profileCompletionDesc
source: Complete your profile accurately
my: သင့်ပရိုဖိုင်ကို မှန်ကန်စွာ ဖြည့်ပါ

# profileItem1
source: Provide accurate personal information
my: ကိုယ်ရေးအချက်အလက်များကို မှန်ကန်စွာ ဖြည့်ပါ

# profileItem2
source: Upload a clear, professional photo
my: ရှင်းလင်းသော ပရိုဖက်ရှင်နယ် ဓာတ်ပုံတင်ပါ

# profileItem3
source: List all relevant work experience
my: သက်ဆိုင်ရာ အလုပ်အတွေ့အကြုံအားလုံးကို ထည့်ပါ

# profileItem4
source: Include certifications and skills
my: လက်မှတ်များနှင့် ကျွမ်းကျင်မှုများကို ထည့်ပါ

# profileItem5
source: Keep your contact information updated
my: ဆက်သွယ်ရန် အချက်အလက်များကို အမြဲ အပ်ဒိတ်လုပ်ပါ

source: Safety & Security
my: လုံခြုံရေး

# safetySecurityDesc
source: Stay safe while using the platform
my: ပလက်ဖောင်းအသုံးပြုစဉ် လုံခြုံရေးကို သတိထားပါ

# safetyItem1
source: Never share your password with anyone
my: စကားဝှက်ကို မည်သူ့ကိုမျှ မမျှဝေပါနှင့်

# safetyItem2
source: Verify employer information before interviews
my: အင်တာဗျူးမတိုင်မီ အလုပ်ရှင် အချက်အလက်များကို စစ်ဆေးပါ

# safetyItem3
source: Report suspicious activities immediately
my: သံသယရှိသော လုပ်ဆောင်မှုများကို ချက်ချင်း အကြောင်းကြားပါ

# safetyItem4
source: Use only official communication channels
my: တရားဝင် ဆက်သွယ်ရေးလမ်းကြောင်းများကိုသာ အသုံးပြုပါ

# safetyItem5
source: Protect your personal documents
my: ကိုယ်ရေးကိုယ်တာ စာရွက်စာတမ်းများကို ကာကွယ်ပါ

source: Professional Conduct
my: ပရိုဖက်ရှင်နယ် အပြုအမူ

# professionalConductDesc
source: Maintain professionalism at all times
my: အချိန်တိုင်း ပရိုဖက်ရှင်နယ် ဖြစ်အောင် ပြုလုပ်ပါ

# professionalItem1
source: Respond to messages promptly
my: မက်ဆေ့ခ်ျများကို အချိန်မီ ပြန်ကြားပါ

# professionalItem2
source: Be honest about your skills and experience
my: သင့်ကျွမ်းကျင်မှုနှင့် အတွေ့အကြုံကို ရိုးသားစွာ ဖော်ပြပါ

# professionalItem3
source: Dress appropriately for interviews
my: အင်တာဗျူးအတွက် သင့်တော်စွာ ဝတ်ဆင်ပါ

# professionalItem4
source: Communicate respectfully with employers
my: အလုပ်ရှင်များနှင့် ယဉ်ကျေးစွာ ဆက်ဆံပါ

# professionalItem5
source: Honor your commitments and schedules
my: ကတိကဝတ်များနှင့် အချိန်ဇယားကို လေးစားပါ

source: Interview Guidelines
my: အင်တာဗျူး လမ်းညွှန်ချက်များ

# interviewGuidelinesDesc
source: Prepare for successful interviews
my: အောင်မြင်သော အင်တာဗျူးအတွက် ပြင်ဆင်ပါ

# interviewItem1
source: Arrive on time for scheduled interviews
my: သတ်မှတ်ထားသော အချိန်အတိုင်း ရောက်ရှိပါ
