Repository: VincentAung9/sg_easy_hire
Catalog: lib/l10n/arb/app_*.arb
Languages: my

# interviewItem2
source: Prepare questions about the job
my: အလုပ်နှင့်ပတ်သက်သော မေးခွန်းများ ပြင်ဆင်ပါ

# interviewItem3
source: Bring necessary documents
my: လိုအပ်သော စာရွက်စာတမ်းများ ယူဆောင်ပါ

# interviewItem4
source: Follow up after interviews
my: အင်တာဗျူးပြီးနောက် ဆက်သွယ်ပါ

# interviewItem5
source: Notify if you need to reschedule
my: အချိန်ပြောင်းရန် လိုအပ်ပါက ကြိုတင် အကြောင်းကြားပါ

source: Do's and Don'ts
my: လုပ်သင့်သောအရာများ / မလုပ်သင့်သောအရာများ

source: Do's
my: လုပ်သင့်သောအရာများ

# doItem1
source: Keep your profile updated regularly
my: သင့်ပရိုဖိုင်ကို ပုံမှန် အပ်ဒိတ်လုပ်ပါ

# doItem2
source: Respond to job offers within 24 hours
my: အလုပ်ကမ်းလှမ်းမှုများကို ၂၄ နာရီအတွင်း တုံ့ပြန်ပါ

# doItem3
source: Provide honest feedback after placements
my: အလုပ်ပြီးနောက် ရိုးသားသော အကြံပြုချက် ပေးပါ

# doItem4
source: Report any issues through proper channels
my: ပြဿနာများကို သင့်လျော်သော လမ်းကြောင်းဖြင့် အကြောင်းကြားပါ

# doItem5
source: Maintain confidentiality of employer information
my: အလုပ်ရှင် အချက်အလက်များကို လျှို့ဝှက်ထားပါ

source: Don'ts
my: မလုပ်သင့်သောအရာများ

# dontItem1
source: Share login credentials with others
my: လော့ဂ်အင် အချက်အလက်များကို မျှဝေခြင်း

# dontItem2
source: Accept payment outside the platform
my: ပလက်ဖောင်းပြင်ပ ငွေပေးချေမှု လက်ခံခြင်း

# dontItem3
source: Misrepresent your qualifications
my: ကိုယ်ရေးအရည်အချင်းကို မမှန်ကန်စွာ ဖော်ပြခြင်း

# dontItem4
source: Ghost employers or miss interviews
my: အလုပ်ရှင်ကို မတုံ့ပြန်ခြင်း သို့မဟုတ် အင်တာဗျူး ပျက်ကွက်ခြင်း

# dontItem5
source: Share inappropriate content
my: မသင့်လျော်သော အကြောင်းအရာများ မျှဝေခြင်း

source: Need Help?
my: အကူအညီလိုပါသလား?

# contactSupport
source: Contact our support team
my: ကျွန်ုပ်တို့၏ အထောက်အပံ့အဖွဲ့ကို ဆက်သွယ်ပါ

source: Get Help
my: အကူအညီ ရယူပါ

source: Actively Hiring
my: အလုပ်ခန့်ထားနေသည်

source: Position Closed
my: အလုပ်ပိတ်ထားသည်

# postedTimeAgo
source: Posted {time}
my: {time} အကြာကတင်ခဲ့သည်

source: Start Date
my: စတင်ရက်

source: Immediate
my: ချက်ချင်း

source: Contract
my: စာချုပ်

source: Applicants
my: လျှောက်ထားသူများ

source: applied
my: ဦး လျှောက်ထားပြီး

source: Employer Information
my: အလုပ်ရှင် အချက်အလက်

source: hires
my: ဦး ခန့်ထားပြီး

source: Job Description
my: အလုပ်ဖော်ပြချက်

source: Responsibilities
my: တာဝန်များ

source: Requirements:
my: လိုအပ်ချက်များ:

source: Other Info
my: အခြားအချက်အလက်များ

source: Off Day
my: နားရက်

source: Children
my: ကလေးများ

source: Children are
my: ကလေးအသက်

source: Adult
my: လူကြီး

source: Elderly
my: အိုမင်းသူ

source: Home Type
my: အိမ်အမျိုးအစား

source: Room Type
my: အခန်းအမျိုးအစား

source: Full-time
my: အချိန်ပြည့်

source: Interview Details
my: အင်တာဗျူး အသေးစိတ်

source: Video Interview
my: ဗီဒီယို အင်တာဗျူး

source: Date Options
my: ရက်စွဲရွေးချယ်မှုများ

source: Time Options
my: အချိန်ရွေးချယ်မှုများ

# minutes30
source: 30 minutes
my: ၃၀ မိနစ်

source: Interview Notes
my: အင်တာဗျူး မှတ်ချက်များ

# reviewsCount
source: {rating} • {count} reviews
my: {rating} • သုံးသပ်ချက် {count} ခု

source: Contact:
my: ဆက်သွယ်ရန်:

source: Email:
my: အီးမေးလ်:

source: Address:
my: လိပ်စာ:

source: Job Details
my: အလုပ် အသေးစိတ်

# personalityType
source: Personality type: {type}
my: ကိုယ်ရည်ကိုယ်သွေး အမျိုးအစား: {type}

source: Your Job Offers
my: သင့်အလုပ်အကိုင် ကမ်းလှမ်းချက်များ

# viewJobsOfferedToYou
source: View the jobs offered to you
my: သင့်ထံ ကမ်းလှမ်းထားသော အလုပ်များကို ကြည့်ရှုပါ

source: No offer jobs yet
my: အလုပ်ကမ်းလှမ်းချက် မရှိသေးပါ

# helpAndSupport
source: Help & Support
my: အကူအညီနှင့် ပံ့ပိုးမှု

source: Contact Us
my: ဆက်သွယ်ရန်

source: Admin Support
my: အက်ဒမင် အကူအညီ

# customerService247
source: 24/7 Customer Service
my: ၂၄/၇ ဖောက်သည်ဝန်ဆောင်မှု

# needHelpChat
source: Need help? Chat with our support team
my: အကူအညီလိုပါသလား။ အထောက်အပံ့အဖွဲ့နှင့် စကားပြောပါ

source: Support
my: အကူအညီ

source: Quick Links
my: လျင်မြန်သော လင့်များ

source: View Guidelines
my: လမ်းညွှန်ချက်များ ကြည့်ရန်

source: Update Documents
my: စာရွက်စာတမ်းများ ပြင်ဆင်ရန်

source: Edit Profile
my: ပရိုဖိုင် ပြင်ရန်

source: Frequently Asked Questions
my: မေးလေ့ရှိသော မေးခွန်းများ

# faqUpdateBiodataQ
source: How do I update my biodata?
my: ကိုယ်ရေးအချက်အလက်ကို ဘယ်လို ပြင်ဆင်ရမလဲ?

# faqUpdateBiodataA
source: Go to your profile section and click on 'Edit Biodata'. You can update your personal information, work experience, and skills from there.
my: သင့်ပရိုဖိုင်အပိုင်းသို့ သွားပြီး 'Edit Biodata' ကို နှိပ်ပါ။ ကိုယ်ရေးအချက်အလက်၊ အလုပ်အတွေ့အကြုံနှင့် ကျွမ်းကျင်မှုများကို ပြင်ဆင်နိုင်ပါသည်။

# faqApplyJobQ
source: How do I apply for a job?
my: အလုပ်ကို ဘယ်လို လျှောက်ရမလဲ?

# faqApplyJobA
source: Browse available jobs in the Jobs section. Click on any job listing to view details, then tap 'Apply Now' to submit your application.
my: Jobs အပိုင်းတွင် ရရှိနိုင်သော အလုပ်များကို ကြည့်ပါ။ အလုပ်တစ်ခုကို ရွေးပြီး အသေးစိတ်ကြည့်ကာ 'Apply Now' ကို နှိပ်ပါ။

# faqInterviewQ
source: How do interviews work?
my: အင်တာဗျူးများ ဘယ်လို လုပ်ဆောင်ပါသလဲ?

# faqInterviewA
source: Once an employer is interested, they'll schedule an interview. You'll receive a notification and can view all interview details in the Interviews section.
my: အလုပ်ရှင် စိတ်ဝင်စားလာပါက အင်တာဗျူး အချိန်ဇယားချထားပါမည်။ သင့်ထံ အသိပေးချက် ရရှိပြီး Interviews အပိုင်းတွင် အသေးစိတ် ကြည့်ရှုနိုင်ပါသည်။

# faqMessageEmployerQ
source: How do I message an employer?
my: အလုပ်ရှင်ကို ဘယ်လို စာပို့ရမလဲ?

# faqMessageEmployerA
source: After being matched with an employer, you can access the Messages section to communicate directly with them.
my: အလုပ်ရှင်နှင့် ကိုက်ညီပြီးနောက် Messages အပိုင်းတွင် တိုက်ရိုက် ဆက်သွယ်နိုင်ပါသည်။

# faqDocumentsQ
source: What documents do I need to upload?
my: ဘယ်လို စာရွက်စာတမ်းတွေ တင်ရမလဲ?

# faqDocumentsA
source: Required documents typically include ID, passport, work permit, and any relevant certifications. Check the Documents section for specific requirements.
my: လိုအပ်သော စာရွက်စာတမ်းများတွင် မှတ်ပုံတင်၊ ပတ်စပို့၊ အလုပ်လုပ်ခွင့်နှင့် သက်ဆိုင်သော လက်မှတ်များ ပါဝင်နိုင်ပါသည်။ Documents အပိုင်းတွင် အသေးစိတ် စစ်ဆေးပါ။

source: Still need help?
my: အကူအညီ မလိုသေးပါသလား?

# adminAvailable247
source: Admin is available 24/7 to assist you
my: အက်ဒမင်သည် ၂၄/၇ အချိန်တိုင်း ကူညီပေးနိုင်ပါသည်

source: Start Live Chat
my: တိုက်ရိုက် စကားပြောရန် စတင်ပါ

# supportChatTitleSelectItem
source: Select an item
my: အရာတစ်ခုကို ရွေးချယ်ပါ

# supportChooseSpecific
source: Choose the specific {type} you need help with
my: အကူအညီလိုအပ်သော {type} ကို ရွေးချယ်ပါ

# supportCreatedAt
source: Created at: {date}
my: ဖန်တီးခဲ့သောနေ့: {date}

# supportSubjectPrefix
source: Support
my: အကူအညီ

# supportEmptyTitle
source: No items found
my: အရာမရှိပါ

# supportEmptyDescription
source: There are no {type} available at the moment
my: လက်ရှိတွင် {type} မရှိသေးပါ

# supportChatTitle
source: Support Chat
my: အကူအညီ ချတ်

# supportOnlineTitle
source: Support Online
my: အကူအညီ အွန်လိုင်း

# supportOnlineSubtitle
source: Ready to help you
my: ကူညီရန် အသင့်ရှိပါသည်

# supportHelpQuestion
source: What do you need help with?
my: ဘာအတွက် အကူအညီလိုပါသလဲ?

# supportHelpDescription
source: Select a category to start chatting with our support team
my: အကူအညီအဖွဲ့နှင့် ချတ်စတင်ရန် အမျိုးအစားကို ရွေးချယ်ပါ

# supportCategoryHiredJobs
source: Hired Jobs
my: အလုပ်ခန့်ထားမှုများ

# supportCategoryHiredJobsDesc
source: Issues related to your current or past employment
my: လက်ရှိ သို့မဟုတ် ယခင် အလုပ်နှင့် ဆိုင်သော ပြဿနာများ

# supportCategoryTransaction
source: Transaction
my: ငွေပေးချေမှု

# supportCategoryTransactionDesc
source: Payment, salary, or financial concerns
my: လစာ၊ ငွေပေးချေမှု သို့မဟုတ် ငွေကြေးဆိုင်ရာ ပြဿနာများ

# supportCategoryDocuments
source: Documents
my: စာရွက်စာတမ်းများ

# supportCategoryDocumentsDesc
source: Document verification or upload issues
my: စာရွက်စာတမ်း အတည်ပြုခြင်း သို့မဟုတ် တင်သွင်းမှု ပြဿနာများ

# supportCategoryAccount
source: Account
my: အကောင့်

# supportCategoryAccountDesc
source: Profile, settings, or account access
my: ပရိုဖိုင်၊ ဆက်တင်များ သို့မဟုတ် အကောင့် ဝင်ရောက်မှု

# supportCategoryOther
source: Other
my: အခြား

# supportCategoryOtherDesc
source: General inquiries or other issues
my: အထွေထွေ မေးခွန်းများ သို့မဟုတ် အခြား ပြဿနာများ

# supportErrorGeneric
source: Something was wrong!
my: အမှားအယွင်း တစ်ခု ဖြစ်ပေါ်နေပါသည်

# relatedTypeHiredJobs
source: Hired Jobs
my: အလုပ်ခန့်ထားမှုများ

# relatedTypeTransaction
source: Transactions
my: ငွေပေးချေမှုများ

# relatedTypeDocument
source: Documents
my: စာရွက်စာတမ်းများ

# relatedTypeAccount
source: Account
my: အကောင့်

# relatedTypeGeneral
source: General
my: အထွေထွေ

source: No {modelType} yet
my: {modelType} မရှိသေးပါ

# settingsTitle
source: Settings
my: ဆက်တင်များ

source: No Name Set
my: နာမည် မသတ်မှတ်ထားပါ

source: No Phone Set
my: ဖုန်းနံပါတ် မသတ်မှတ်ထားပါ

# avatarLabel
source: Avatar
my: ပုံ

# updateButton
source: Update
my: ပြောင်းလဲမည်

# employerDashboard_headerSubtitle
source: Manage your hiring process
my: အလုပ်ခန့်အပ်မှုလုပ်ငန်းစဉ်ကို စီမံခန့်ခွဲပါ

# employerDashboard_weeklyInterviewQuota
source: Weekly Interview Quota
my: အပတ်စဉ် အင်တာဗျူး ကန့်သတ်ချက်

# employerDashboard_interviewsRemainingThisWeek
source: {count} interviews remaining this week
my: ဒီအပတ်အတွင်း အင်တာဗျူး {count} ခု ကျန်ရှိသေးသည်

# employerDashboard_quickActions
source: Quick Actions
my: အမြန်လုပ်ဆောင်ချက်များ

# employerDashboard_browseHelpers
source: Browse Helpers
my: Helper များ ရှာဖွေမည်

# employerDashboard_viewApplicants
source: View Applicants
my: လျှောက်ထားသူများ ကြည့်မည်

# employerDashboard_editJobPost
source: Edit Job Post
my: Job Post ပြင်မည်

# employerDashboard_appGuide
source: App Guide
my: App လမ်းညွှန် ကြည့်မည်

# employerDashboard_upcomingInterview
source: Upcoming Interview
my: နောက်တစ်ကြိမ် အင်တာဗျူး

# employerDashboard_confirmed
source: Confirmed
my: အတည်ပြုပြီး

# employerDashboard_age
source: Age
my: အသက်

# employerDashboard_weight
source: Weight
my: အလေးချိန်

# employerDashboard_height
source: Height
my: အရပ်

# employerDashboard_days
source: days
my: နေ့

# employerDashboard_hours
source: hours
my: နာရီ

# employerDashboard_minutes
source: minutes
my: မိနစ်

# employerDashboard_documentStatus
source: Document Status
my: စာရွက်စာတမ်း အခြေအနေ

# employerDashboard_passport
source: Passport
my: ပတ်စပို့

# employerDashboard_medical
source: Medical
my: ဆေးစစ်ချက်

# employerDashboard_training
source: Training
my: သင်တန်း

# employerDashboard_verified
source: Verified
my: စစ်ဆေးအတည်ပြုပြီး

# employerDashboard_pending
source: Pending
my: စစ်ဆေးဆဲ

# employerDashboard_timeUntilInterview
source: Time until interview
my: အင်တာဗျူးအတွက် ကျန်ချိန်

# employerDashboard_viewBiodata
source: View Biodata
my: Biodata ကြည့်မည်

# employerDashboard_cancel
source: Cancel
my: ပယ်ဖျက်မည်

# employerDashboard_joinCall
source: Join Call
my: Call ဝင်မည်

# employerDashboard_cancelFailed
source: Failed to cancel the interview. Please try again.
my: အင်တာဗျူးကို ပယ်ဖျက်မရပါ။ ထပ်မံကြိုးစားပါ။

# employerDashboard_cancelSuccess
source: Interview cancelled successfully.
my: အင်တာဗျူးကို အောင်မြင်စွာ ပယ်ဖျက်ပြီးပါပြီ။

# employerDashboard_singleHelperPolicyTitle
source: Single Helper Policy
my: Helper တစ်ယောက်တည်း ခန့်အပ်မှု စည်းမျဉ်း

# employerDashboard_singleHelperPolicyDesc
source: You can only hire one helper at a time. Once you accept an order, other helper profiles will be hidden.
my: တစ်ချိန်တည်းမှာ Helper တစ်ယောက်တည်းကိုသာ ခန့်အပ်နိုင်ပါတယ်။ Order ကိုလက်ခံပြီးပါက အခြား Helper Profile များကို ဖျောက်ထားမည်ဖြစ်သည်။

# employerDashboard_needAssistance
source: Need Assistance?
my: အကူအညီလိုပါသလား?

# employerDashboard_supportSubtitle
source: Contact support for help with your hiring process
my: အလုပ်ခန့်အပ်မှုလုပ်ငန်းစဉ်အတွက် အကူအညီလိုပါက Support ကို ဆက်သွယ်ပါ

# employerDashboard_contactSupport
source: Contact Support
my: Support ကို ဆက်သွယ်မည်

# findHelpers_title
source: Find Helpers
my: Helper များကို ရှာဖွေမည်

# findHelpers_searchHint
source: Search by name, skills, nationality...
my: အမည်၊ ကျွမ်းကျင်မှု၊ နိုင်ငံသားမှု စသည်ဖြင့် ရှာဖွေပါ...

# findHelpers_filterSkillsAll
source: Skills: All
my: ကျွမ်းကျင်မှု: အားလုံး

# findHelpers_filterLanguageAll
source: Language: All
my: ဘာသာစကား: အားလုံး

# findHelpers_filterCompatiblePersonality
source: Compatible Personality
my: ကိုက်ညီသော ကိုယ်ရည်ကိုယ်သွေး

# findHelpers_noResults
source: No matching results found.
my: ကိုက်ညီသော ရလဒ် မတွေ့ပါ။

# employerInterview_title
source: Interviews
my: အင်တာဗျူးများ

# employerInterview_subtitle
source: Manage your interview requests
my: အင်တာဗျူးတောင်းဆိုမှုများကို စီမံခန့်ခွဲပါ

# employerInterview_tabConfirmed
source: Confirmed
my: အတည်ပြုပြီး

# employerInterview_tabPending
source: Pending
my: စောင့်ဆိုင်းဆဲ

# employerInterview_tabCompleted
source: Completed
my: ပြီးဆုံးပြီး

# employerInterview_noResults
source: No matching results found.
my: ကိုက်ညီသော ရလဒ် မတွေ့ပါ။

# messages_title
source: Messages
my: မက်ဆေ့ချ်များ

# messages_subtitle
source: Chat with helpers after interviews
my: အင်တာဗျူးပြီးနောက် Helper များနှင့် စကားပြောနိုင်သည်

# messages_infoTitle
source: Chat After Interview
my: အင်တာဗျူးပြီးနောက် စကားပြောခြင်း

# messages_infoDesc
source: You can chat with helpers after completing an interview. Use chat to make offers or arrange additional interviews.
my: အင်တာဗျူးပြီးဆုံးပြီးနောက် Helper များနှင့် စကားပြောနိုင်ပါတယ်။ Chat ကို Offer ပေးရန် သို့မဟုတ် အင်တာဗျူးထပ်မံ ချိန်းဆိုရန် အသုံးပြုနိုင်ပါတယ်။

# messages_availableChats
source: Available Chats
my: စကားပြောရန် ရနိုင်သော Chat များ

# messages_interviewCompletedOn
source: Interview completed on {date}
my: {date} တွင် အင်တာဗျူးပြီးဆုံးခဲ့သည်

# messages_statusAvailable
source: Available
my: ရရှိနိုင်သည်

# messages_needHelp
source: Need Help?
my: အကူအညီလိုပါသလား?

# messages_supportSubtitle
source: Our support team is here to assist you
my: Support အဖွဲ့က သင့်ကို ကူညီပေးရန် အမြဲရှိပါတယ်

# messages_contactSupport
source: Contact Support
my: Support ကို ဆက်သွယ်မည်

# employerAccount_title
source: Employer Account
my: အလုပ်ရှင် အကောင့်

# employerAccount_menu_personalInformation
source: Personal Information
my: ကိုယ်ရေးအချက်အလက်

# employerAccount_menu_personalityTest
source: Personality Test
my: ကိုယ်ရည်ကိုယ်သွေး စစ်ဆေးမှု

# employerAccount_menu_jobDescription
source: Job Description
my: အလုပ်ဖော်ပြချက်

# employerAccount_menu_favoriteHelpers
source: Favorite Helpers
my: နှစ်သက်သော Helper များ

# employerAccount_menu_paymentMethod
source: Payment Method
my: ငွေပေးချေမှု နည်းလမ်း

# employerAccount_menu_offeredJobs
source: Offered Jobs
my: အော်ဖာပေးထားသော အလုပ်များ

# employerAccount_hiringProgressTitle
source: Hiring Progress
my: ခန့်အပ်မှု တိုးတက်မှု

# employerAccount_progress_profileCreated
source: Profile Created
my: ပရိုဖိုင် ဖန်တီးပြီး

# employerAccount_progress_jobPosted
source: Job Posted
my: အလုပ်တင်ပြီး

# employerAccount_progress_interviewScheduled
source: Interview Scheduled
my: အင်တာဗျူး ချိန်းပြီး

# employerAccount_progress_offerMade
source: Offer Made
my: အော်ဖာ ပေးပြီး

# employerAccount_progress_offerMadeSubtitle
source: Awaiting helper's response
my: Helper ရဲ့ ပြန်လည်တုံ့ပြန်မှုကို စောင့်နေသည်

# employerAccount_progress_inProgress
source: In Progress
my: လုပ်ဆောင်နေဆဲ

# employerAccount_progress_contractSigned
source: Contract Signed
my: စာချုပ် လက်မှတ်ရေးထိုးပြီး

# employerAccount_progress_contractSignedSubtitle
source: Both parties sign service agreement
my: နှစ်ဖက်စလုံး Service Agreement ကို လက်မှတ်ရေးထိုးသည်

# employerAccount_progress_contractSignedStatus
source: ~2 days after acceptance
my: လက်ခံပြီးနောက် ~၂ ရက်ခန့်

# employerAccount_progress_passportVerification
source: Helper Passport Verification
my: Helper ပတ်စပို့ စစ်ဆေးခြင်း

# employerAccount_progress_passportVerificationSubtitle
source: If not previously completed
my: မပြီးဆုံးသေးပါက

# employerAccount_progress_passportVerificationStatus
source: ~3-5 days
my: ~၃-၅ ရက်

# employerAccount_progress_medicalExam
source: Medical Examination
my: ဆေးစစ်မှု

# employerAccount_progress_medicalExamSubtitle
source: Helper completes medical check
my: Helper သည် ဆေးစစ်ခြင်းကို ပြုလုပ်သည်

# employerAccount_progress_medicalExamStatus
source: ~1 week
my: ~၁ ပတ်

# employerAccount_progress_trainingArrival
source: Training Centre Arrival
my: သင်တန်းစင်တာ ရောက်ရှိခြင်း

# employerAccount_progress_trainingArrivalSubtitle
source: Helper arrives at training facility
my: Helper သည် သင်တန်းစင်တာသို့ ရောက်ရှိသည်

# employerAccount_progress_trainingArrivalStatus
source: ~2 weeks
my: ~၂ ပတ်

# employerAccount_progress_ipaApplication
source: IPA Application
my: IPA လျှောက်ထားခြင်း

# employerAccount_progress_ipaApplicationSubtitle
source: In-Principle Approval processing
my: In-Principle Approval စီမံဆောင်ရွက်ခြင်း

# employerAccount_progress_ipaApplicationStatus
source: ~3-4 weeks
my: ~၃-၄ ပတ်

# employerAccount_progress_insurancePurchase
source: Insurance Purchase
my: အာမခံ ဝယ်ယူခြင်း

# employerAccount_progress_insurancePurchaseSubtitle
source: Employer purchases insurance policy
my: Employer သည် အာမခံပေါ်လစီ ဝယ်ယူသည်

# employerAccount_progress_insurancePurchaseStatus
source: After IPA approval
my: IPA အတည်ပြုပြီးနောက်

# employerAccount_progress_airTicketPurchase
source: Air Ticket Purchase
my: လေယာဉ်လက်မှတ် ဝယ်ယူခြင်း

# employerAccount_progress_airTicketPurchaseSubtitle
source: Book helper's flight
my: Helper ရဲ့ လေယာဉ်ခရီးစဉ်ကို ဘိုကင်လုပ်သည်

# employerAccount_progress_airTicketPurchaseStatus
source: ~5-6 weeks
my: ~၅-၆ ပတ်

# employerAccount_progress_sipMedicalScheduled
source: SIP & Medical Scheduled
my: SIP နှင့် ဆေးချိန်း စီစဉ်ခြင်း

# employerAccount_progress_sipMedicalScheduledSubtitle
source: Settling-In Programme and medical appointments
my: Settling-In Programme နှင့် ဆေးချိန်းများ စီစဉ်ခြင်း

# employerAccount_progress_sipMedicalScheduledStatus
source: Before arrival
my: ရောက်မလာမီ

# employerAccount_progress_handoverDate
source: Handover Date
my: လွှဲပြောင်းနေ့

# employerAccount_progress_handoverDateSubtitle
source: Helper arrives and starts work
my: Helper ရောက်လာပြီး အလုပ်စတင်သည်

# employerAccount_progress_handoverDateStatus
source: ~6-8 weeks total
my: စုစုပေါင်း ~၆-၈ ပတ်

# employerAccount_logout
source: Logout
my: ထွက်မည်

# employerAccount_deleteAccount
source: Delete Account
my: အကောင့် ဖျက်မည်

# employerAccount_deleteDialogTitle
source: Delete Account
my: အကောင့် ဖျက်မည်

# employerAccount_deleteDialogDesc
source: Are you sure you want to delete your account? This action cannot be undone.
my: သင့်အကောင့်ကို ဖျက်ချင်တာ သေချာပါသလား? ဒီလုပ်ဆောင်ချက်ကို ပြန်လည်မလုပ်နိုင်ပါ။

# employerAccount_cancel
source: Cancel
my: မလုပ်တော့ပါ

# employerAccount_delete
source: Delete
my: ဖျက်မည်

# jobSearchDashboard_title
source: Job Search Dashboard
my: အလုပ်ရှာဖွေရေး ဒက်ရှ်ဘုတ်

# jobSearchDashboard_profileCompletionTitle
source: Complete Your Profile
my: ပရိုဖိုင် ပြည့်စုံအောင် ဖြည့်ပါ

# jobSearchDashboard_profileCompletionSubtitle
source: Finish your profile to increase your chances of getting hired
my: အလုပ်ရရှိနိုင်ခြေ ပိုမိုမြင့်မားစေရန် ပရိုဖိုင်ကို ပြည့်စုံအောင် ဖြည့်ပါ

# jobSearchDashboard_quickActions
source: Quick Actions
my: အမြန်လုပ်ဆောင်ချက်များ

# jobSearchDashboard_quickActionBrowseJobs
source: Browse Jobs
my: အလုပ်များ ရှာဖွေမည်

# jobSearchDashboard_quickActionSavedJobs
source: Saved Jobs
my: သိမ်းထားသော အလုပ်များ

# jobSearchDashboard_quickActionApplications
source: My Applications
my: လျှောက်ထားပြီးသားများ

# jobSearchDashboard_nextInterview
source: Next Interview
my: နောက်လာမည့် အင်တာဗျူး

# jobSearchDashboard_noUpcomingInterview
source: No upcoming interviews
my: လာမည့် အင်တာဗျူး မရှိသေးပါ

# jobSearchDashboard_recommendedJobs
source: Recommended Jobs
my: အကြံပြုထားသော အလုပ်များ

# jobSearchDashboard_viewAllJobs
source: View All Jobs
my: အလုပ်အားလုံး ကြည့်မည်

# findJobs_title
source: Find Jobs
my: အလုပ်များ ရှာဖွေမည်

# findJobs_filterAll
source: All
my: အားလုံး

# findJobs_filterFullTime
source: Full Time
my: အချိန်ပြည့်

# findJobs_filterPartTime
source: Part Time
my: အချိန်ပိုင်း

# findJobs_filterLiveIn
source: Live-in
my: နေထိုင်ရမည့် အလုပ်

# findJobs_filterLiveOut
source: Live-out
my: မနေထိုင်ရသော အလုပ်

# findJobs_searchHint
source: Search jobs by title, location, or skills
my: အလုပ်ခေါင်းစဉ်၊ တည်နေရာ၊ ကျွမ်းကျင်မှုဖြင့် ရှာဖွေပါ

# findJobs_noResults
source: No matching results found.
my: ကိုက်ညီသော ရလဒ် မတွေ့ပါ။

# helperInterviews_title
source: My Interviews
my: ကျွန်ုပ်၏ အင်တာဗျူးများ

# helperInterviews_tabPending
source: Pending
my: စောင့်ဆိုင်းဆဲ

# helperInterviews_tabAccepted
source: Accepted
my: လက်ခံပြီး

# helperInterviews_tabCompletedCancelled
source: Completed / Cancelled
my: ပြီးဆုံး / ပယ်ဖျက်ပြီး

# helperInterviews_tabCompleted
source: Completed
my: ပြီးဆုံး

# helperInterviews_tabCancelled
source: Cancelled
my: ပယ်ဖျက်ပြီး

# helperInterviews_noPending
source: No pending interviews
my: စောင့်ဆိုင်းဆဲ အင်တာဗျူး မရှိပါ

# helperInterviews_noAccepted
source: No accepted interviews
my: လက်ခံပြီးသော အင်တာဗျူး မရှိပါ

# helperInterviews_noCompletedCancelled
source: No completed or cancelled interviews
my: ပြီးဆုံး သို့မဟုတ် ပယ်ဖျက်ပြီးသော အင်တာဗျူး မရှိပါ

# helperMessages_title
source: Messages
my: မက်ဆေ့ချ်များ

# helperMessages_timeJustNow
source: Just now
my: ယခုလေးတင်

# helperMessages_timeMinutesAgo
source: {count} min ago
my: {count} မိနစ် အကြာ

# helperMessages_timeHoursAgo
source: {count} hour ago
my: {count} နာရီ အကြာ

# helperMessages_timeYesterday
source: Yesterday
my: မနေ့က

# helperMessages_timeDaysAgo
source: {count} days ago
my: {count} ရက် အကြာ

# helperMessages_jobOfferExtended
source: 🎉 Job Offer Extended - {salary}/month
my: 🎉 အလုပ်အော်ဖာ ပေးထားသည် - တစ်လ {salary}

# helperMessages_interviewFollowUp
source: Thank you for the interview. We will get back to you soon.
my: အင်တာဗျူးအတွက် ကျေးဇူးတင်ပါတယ်။ မကြာမီ ပြန်လည် ဆက်သွယ်ပါမည်။

# helperMessages_workPassApproved
source: Your work pass application has been approved
my: သင့်အလုပ်ပါမစ် လျှောက်လွှာကို အတည်ပြုပြီးပါပြီ

# helperMessages_welcomeSupport
source: Welcome to Helper App! How can we help you?
my: Helper App မှ ကြိုဆိုပါတယ်။ ဘာကူညီပေးရမလဲ?

# helperMessages_emptyTitle
source: No messages yet
my: မက်ဆေ့ချ် မရှိသေးပါ

# helperMessages_emptySubtitle
source: Your messages with employers will appear here
my: Employer များနှင့် စကားပြောသည့် မက်ဆေ့ချ်များကို ဒီမှာ ပြသပါမည်

# helperAccount_biodata
source: Biodata
my: ကိုယ်ရေးအချက်အလက်

# helperAccount_biodataSubtitle
source: Name, contact, nationality
my: အမည်၊ ဆက်သွယ်ရန်၊ နိုင်ငံသားမှု

# helperAccount_documents
source: Documents
my: စာရွက်စာတမ်းများ

# helperAccount_documentsSubtitle
source: Passport, certificates, medical
my: ပတ်စပို့၊ လက်မှတ်များ၊ ဆေးစစ်ချက်

# helperAccount_preferences
source: Preferences
my: လိုအပ်ချက်များ

# helperAccount_preferencesSubtitle
source: Salary, location, duties
my: လစာ၊ တည်နေရာ၊ တာဝန်များ

# helperAccount_jobOffers
source: Job Offers
my: အလုပ်အော်ဖာများ

# helperAccount_jobOffersSubtitle
source: View offers received from employers
my: Employer များမှ ပေးထားသော အော်ဖာများကို ကြည့်မည်

# helperAccount_newCount
source: {count} New
my: အသစ် {count} ခု

# helperAccount_progressTracking
source: Progress Tracking
my: တိုးတက်မှု ကြည့်ရှုခြင်း

# helperAccount_progressTrackingSubtitle
source: View hiring process status
my: ခန့်အပ်မှု လုပ်ငန်းစဉ် အခြေအနေကို ကြည့်မည်

# helperAccount_helpSupport
source: Help & Support
my: အကူအညီ & ပံ့ပိုးမှု

# helperAccount_helpSupportSubtitle
source: FAQs, contact agency
my: မေးလေ့ရှိသည့်မေးခွန်းများ၊ အေဂျင်စီဆက်သွယ်ရန်

# helperAccount_settings
source: Settings
my: ဆက်တင်များ

# helperAccount_settingsSubtitle
source: Profile Manage
my: ပရိုဖိုင် စီမံခန့်ခွဲခြင်း

# helperAccount_logout
source: Log Out
my: ထွက်မည်

# helperAccount_deleteAccount
source: Delete Account
my: အကောင့် ဖျက်မည်

# helperAccount_deleteAccountSubtitle
source: Permanently remove your account
my: အကောင့်ကို အပြီးတိုင် ဖယ်ရှားမည်
