Repository: VincentAung9/sg_easy_hire
Catalog: lib/l10n/arb/app_*.arb
Languages: my

# helperAccount_logoutDialogTitle
source: Logout
my: ထွက်မည်

# helperAccount_logoutDialogDesc
source: Are you sure you want to logout?
my: ထွက်ချင်တာ သေချာပါသလား?

# helperAccount_deleteDialogTitle
source: Delete Account
my: အကောင့် ဖျက်မည်

# helperAccount_deleteDialogDesc
source: Are you sure you want to delete your account? This action cannot be undone.
my: အကောင့်ကို ဖျက်ချင်တာ သေချာပါသလား? ဒီလုပ်ဆောင်ချက်ကို ပြန်လည်မလုပ်နိုင်ပါ။

# helperAccount_cancel
source: Cancel
my: မလုပ်တော့ပါ

# helperAccount_delete
source: Delete
my: ဖျက်မည်

# helperAccount_snackLoggedOut
source: Logged out!
my: ထွက်ပြီးပါပြီ!

# helperAccount_snackAccountDeleted
source: Account deleted successfully.
my: အကောင့်ကို အောင်မြင်စွာ ဖျက်ပြီးပါပြီ။
